title: "Browser Credentials AccessChk"
id: 
description: "Modified SysInternals AccessChk Chrome password collector - To focus on detection, we're looking for AccessChk.exe where the DisplayName does not match that of the original. There's 4X as many Cross_Process objects with this query but none detect the collection of the Chrome password db."
references:
- keyboardcrunch
author: Cyber Panda
date: 2023/04/03
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.collection
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ‘accesschk.exe’
   selection2:
    ImageDisplayName|contains:
    - ‘Reports effective permissions for securable objects’
  condition: selection and NOT selection2
fields:
- ""
falsepositives:
- 
level: "high"
