title: "LSASS ProcDump"
id: 
description: “LSASS ProcDump"
references:
- 
author: Cyber Panda
date: 2023/01/15
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.collection
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains|all:  
      - ‘procdump'
      - ‘lsass'
    selection2:
     ScriptBlockText|contains|all:  
      - ‘procdump'
      - ‘lsass'
  condition: selection or selection2
fields:
- ""
falsepositives:
- 
level: "medium"
