title: "NTDS Copy (Under Prcoess Context)"
id: 
description: “We won't bother detecting VSS copies being created, rather detecting credential file copies. NTDS.dit or SYSTEM whether a VSS copy or not.”
references:
- keyboardcrunch
author: Cyber Panda
date: 2023/04/03
tags:
- attack.credential_access
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ‘ntdsutil.exe’
    - ‘mklink.exe’
    selection2:
        CommandLine|contains:
        	- ‘ac i ntds'
        	- ‘GLOBALROOT\\Device\\HarddiskVolumeShadowCopy'
     selection3:
        ScriptBlockText|contains:
          	- ‘ac i ntds’
        	- ‘GLOBALROOT\\Device\\HarddiskVolumeShadowCopy'
  condition: selection and (selection2 or selection3)
fields:
- ""
falsepositives:
- 
level: "high"
