title: "Registry Credential Enumeration"
id: 
description: “This query detects enumeration and discovery of credentials within the Registry, including Putty sessions.”
references:
- keyboardcrunch
author: Cyber Panda
date: 2023/04/03
tags:
- attack.credential_access
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
        CommandLine|contains:
        	- ‘query HKLM /f password /t REG_SZ /s'
        	- ‘query HKCU /f password /t REG_SZ /s'
        	- ‘query HKCU\Software\SimonTatham\PuTTY\Sessions /t REG_SZ /s'
     selection2:
        ScriptBlockText|contains:
        	- ‘query HKLM /f password /t REG_SZ /s'
        	- ‘query HKCU /f password /t REG_SZ /s'
        	- ‘query HKCU\Software\SimonTatham\PuTTY\Sessions /t REG_SZ /s'
  condition: selection or selection2
fields:
- ""
falsepositives:
- 
level: "high"
