title: "Win32Time invoked"
id: 
description: "Win32Time invoked"
references:
- https://www.ired.team/offensive-security/persistence/t1209-hijacking-time-providers
author: Cyber Panda
date: 2023/04/05
tags:
- attack.persistence
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ‘powershell.exe’
    - ‘cmd.exe’
   selection2:
    CommandLine|contains|all:
    - ‘sc.exe’
    - ‘w32time’
  condition: selection and selection2
fields:
- ""
falsepositives:
level: "high"
