title: Double Extension (.exe)
id:
status: experimental
description: Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns.
references:
   → https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil 
   → https://www.varonis.com/blog/the-malware-hiding-in-your-windows-system32-folder-part-iii-certutil-and-alternate-data-streams 
   → https://www.trendmicro.com/en_us/research/18/j/malware-targeting-brazil-uses-legitimate-windows-components-wmi-and-certutil-as-part-of-its-routine.html  
   → https://securityintelligence.com/posts/x-force-prevents-zero-day-from-going-anywhere/
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.initial_access
    - certutil
logsource:
    category: process_creation
detection:
    selection:
        Image|endswith:
            - .doc.exe
            - .docx.exe
            - .xls.exe
            - .xlsx.exe
            - .ppt.exe
            - .pptx.exe
            - .rtf.exe
            - .pdf.exe
            - .txt.exe
            -       .exe
            - ______.exe
    condition: selection
falsepositives:
    - 
level: medium
