title: "Kali Common Tools
id: 
description: "Common Kali Tools. Can flush out and test more but this is a solid tested base."
references:
- https://www.varonis.com/blog/the-malware-hiding-in-your-windows-system32-folder-part-iii-certutil-and-alternate-data-streams 
author: Cyber Panda
date: 2023/01/15
tags:
- attack.initial_access
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ‘sqlmap’
    - ‘.teamserver’
    - ‘.aircrack-ng'
    - 'john’
    - ‘setoolkit’
    - 'wpscan'
    - ‘hydra’
    - ‘nikto’
  condition: selection
fields:
- ""
falsepositives:
- None known
level: "medium"
