title: “Ransomware Inhibit System Recovery"
id: 
description: “Ransomware often tries to inhibit system recovery, here are a few techniques"
references:
-  
author: Cyber Panda
date: 2023/01/15
tags:
- attack.initial_access
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
     selection:
        CommandLine|contains:
        	- ‘delete shadows’
       		- ‘shadowcopy delete’
       		- ‘delete catalog’
       		- ‘recoveryenabled no’
     selection2:
        ScriptBlockText|contains:
        	- ‘delete shadows’
       		- ‘shadowcopy delete’
       		- ‘delete catalog’
       		- ‘recoveryenabled no’
     selection3:
        CommandLine|contains|all:
        	- ‘Win32_ShadowCopy’
       		- ‘Delete()'
     selection4:
        ScriptBlockText|contains:
        	- ‘Win32_ShadowCopy’
       		- ‘Delete()'
  condition: (selection or selection2) OR (selection3 or selection4)
fields:
- ""
falsepositives:
- None known
level: "medium"
