title: "Scheduled Task at Interactive Cmd"
id: 
description: "A scheduled task invoking at and the interactive parameter"
references:
- https://www.ired.team/offensive-security/persistence/t1209-hijacking-time-providers
- https://learn.microsoft.com/en-us/troubleshoot/windows-client/system-management-components/use-at-command-to-schedule-tasks
author: Cyber Panda
date: 2023/04/05
tags:
- attack.persistence
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    	CommandLine|contains|all:
    		- ‘at’
    		-'interactive'
	selection2:
    	ScriptBlockText|contains|all:
    		- ‘at’
    		-'interactive'
  condition: selection or selection2
fields:
- ""
falsepositives:
level: "high"
