title: “Pass the Hash & Pass the Ticket”
id:
status: experimental
description: Here we're focusing on detecting command line arguments of Mimikatz, so binary and powershell mimikatz will be detected assuming arguments haven't been modified before deployment.
references:
   → keyboardcrunch
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.lateral_movement
logsource:
    category: process_creation
detection:
    selection:
        CommandLine|contains:
        	- ‘sekurlsa::pth’
        	- ‘/ntlm:'
        	- ‘kerberos::ptt'
     selection2:
        ScriptBlockText|contains:
        	- ‘sekurlsa::pth’
        	- ‘/ntlm:'
        	- ‘kerberos::ptt'
    condition: selection or selection2
falsepositives:
    - 
level: medium
