title: “Port Proxy”
id:
status: experimental
description: 
references:
   → https://book.hacktricks.xyz/generic-methodologies-and-resources/tunneling-and-port-forwarding  
   → SEC588 b5p97
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.lateral_movement
logsource:
    category: process_creation
detection:
    selection:
        CommandLine|contains:
        	- ‘portproxy add'
     selection2:
        ScriptBlockText|contains:
        	- ‘portproxy add'
    condition: selection or selection2
falsepositives:
    - 
level: medium
