title: "Reverse Shells"
id: 
description: "Reverse Shells"
references:
- https://blogs.juniper.net/en-us/threat-research/a-custom-python-backdoor-for-vmware-esxi-servers
- https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
author: Cyber Panda
date: 2023/02/06
tags:
- attack.lateral_movement
- atttack.command_and_control
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains:  
      - ‘bash’
    selection2:
     CommandLine|contains:  
      - ‘/dev/tcp’
  condition: selection and selection2
fields:
- ""
falsepositives:
- None known
level: "medium"
