title: “Scripted Lateral RDP”
id:
status: experimental
description: focuses on detecting the use of cmdkey for authenticating RDP sessions (often used for automated lateral movement).
references:
   → keyboardcrunch
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.lateral_movement
logsource:
    category: process_creation
detection:
  selection:
    Image|contains:
    - ‘cmdkey.exe’
    selection2:
        CommandLine|contains|all:
        	- ‘/generic:TERMSRV'
        	- ‘/user:'
        	- ‘/pass:'
     selection3:
        ScriptBlockText|contains|all:
         	- ‘/generic:TERMSRV'
        	- ‘/user:'
        	- ‘/pass:'
    condition: selection and (selection2 or selection3)
falsepositives:
    - 
level: medium
