title: “WMI Remote Code Execution”
id:
status: experimental
description: 
references:
   → 
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.lateral_movement
logsource:
    category: process_creation
detection:
    selection:
        CommandLine|contains:
        	- ‘process call create'
    selection2:
        CommandLine|contains:
        	- ‘Cloud_DataCollector'
     selection3:
        ScriptBlockText|contains:
        	- ‘process call create'
     selection4:
        ScriptBlockText|contains:
        	- ‘Cloud_DataCollector'
    condition: (selection and NOT selection2) or (selection3 and NOT selection4)
falsepositives:
    - IBM Data Collector
level: medium
