title: Firewall (Defender) Enable SMB RDP
id:
status: experimental
description:  Atomic #3 - Allow SMB and RDP on Defender Firewall
references:
   → keyboardcrunch
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
detection:
    selection:
        Image|contains:
            - ‘netsh.exe’
     selection2:
        CommandLine|contains|any:
        	- ‘remote desktop’
        	- ‘file and printer sharing’
     selection3:
        CommandLine|contains|any:
        	- ‘enable=Yes’
     selection4:
        ScriptBlockText|contains:
        	- ‘remote desktop’
        	- ‘file and printer sharing’
     selection5:
        ScriptBlockText|contains:
        	- ‘enable=Yes’
    condition: selection and ((selection2 and selection3) or (selection4 and selection5))
falsepositives:
    - 
level: medium
