title: FireWall (Defender) Disable via Cmd
id:
status: experimental
description: Atomic #2 - Disable Defender Firewall revisiting
references:
   → keyboardcrunch
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
detection:
    selection:
        Image|contains:
            - ‘netsh.exe’
     selection2:
        CommandLine|contains|any:
        	- ‘state off’
     selection3:
        ScriptBlockText|contains:
        	- ‘state off’
    condition: selection and (selection2 or selection3)
falsepositives:
    - 
level: medium
