title: IIS Logging Disable (appcmd.exe)
id:
status: experimental
description: Atomic #1 - Disable IIS Logging
references:
   → keyboardcrunch
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
detection:
    selection:
        Image|endswith:
            - 'wevtutil.exe'
     selection2:
        CommandLine|contains:
        	- '/dontLog:true'
        	- ‘/section:httplogging’
     selection3:
        ScriptBlockText|contains:
        	- '/dontLog:true'
        	- ‘/section:httplogging’
    condition: selection and (selection2 or selection3)
falsepositives:
    - 
level: medium
