title: "Process Hollowing (Start-Hollow)"
id: 
description: Detect Process Hollowing using the Start-Hollow powershell script, through CommandLine and CommandScript indicators.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md
author: Cyber Panda
date: 2023/01/15
tags:
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains:  
      - ‘Start-Hollow’ 
    selection2:
     ScriptBlockText|contains:  
      - 'Start-Hollow’ 
  condition: selection or selection2
fields:
- ""
falsepositives:
- None known
level: "medium"
