title: "UAC Bypass (Cmd)"
id: 
description: “Detection of UAC bypass through tampering with Shell Open for .ms-settings or .msc file types. Beyond this Atomic test, and to further UAC bypass detection, the below query includes detection for CMSTPLUA COM interface abuse by GUID. See [Security-in-bits]"
references:
- https://www.securityinbits.com/malware-analysis/uac-bypass-analysis-stage-1-ataware-ransomware-part-2/#footnote
author: Cyber Panda
date: 2023/01/15
tags:
- attack.privilege_escalation
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains:  
      - ‘ms-settings\shell\open\command'
      - ‘mscfile\shell\open\command’
    selection2:
     ScriptBlockText|contains:  
      - ‘ms-settings\shell\open\command'
      - ‘mscfile\shell\open\command’
  condition: selection or selection2
fields:
- ""
falsepositives:
- 
level: "medium"
