title: "COR Profiler"
id: 
description: "Detection of unmanaged COR profiler hooking of .NET CLR through registry or process command."
references:
- keyboardcrunch
author: Cyber Panda
date: 2023/01/15
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains|all:  
      - ‘COR_'
      - ‘\Environment’
    selection2:
     CommandLine|contains:  
      - ‘$env:COR_’ 
    selection3:
     ScriptBlockText|contains|all:  
      - ‘COR_'
      - ‘\Environment’
    selection4:
     ScriptBlockText|contains:  
      - ‘$env:COR_’ 
  condition: selection or selection2 or selection3 or selection4
fields:
- ""
falsepositives:
- stackify
level: "medium"
