title: "Core Windows Processes Abnormal Folders"
id: 
description: "Core Windows Processes Abnormal Folders"
references:
- https://exploitmonday.blogspot.com/2013_02_17_archive.html
author: Cyber Panda
date: 2023/02/01
tags:
- attack.execution
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName|equals:
    - ‘userinit.exe’
    - ‘explorer.exe’
    - ‘LogonUI.exe’
    - ‘smss.exe’
    - ‘ntoskrnl.exe’
    - ‘csrss.exe’
    - 'wininit.exe'
    - ‘services.exe’
    - ‘winlogon.exe’
    - ‘userinit.exe’
    - ‘dwm.exe’
    - 'lsass.exe'
    - ‘svchost.exe’
   selection2:
    Image|contains:
    - ‘Windows’
  condition: selection and not selection2
fields:
- ""
falsepositives:
- None known
level: "medium"
