title: "Get-GPPPassword (PowerSploit)"
id: 
description: "Get-GPPPassword (PowerSploit)"
references:
- https://fuzzysecurity.com/tutorials/16.html
author: Cyber Panda
date: 2023/04/06
tags:
- attack.privilege_escalation
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ‘Get-GPPPassword’
  condition: selection
fields:
- ""
falsepositives:
- No
level: "high"
