title: "Logon Scripts (Cmd)"
id: 
description: Detects addition of logon scripts through command line or registry methods. 
references:
- keyboardcrunch
author: Cyber Panda
date: 2023/01/15
tags:
- attack.persistence
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains:  
      - ‘UserInitMprLogonScript'
      - ‘\Environment’
    selection2:
     ScriptBlockText|contains:  
      - ‘UserInitMprLogonScript'
  condition: selection or selection2
fields:
- ""
falsepositives:
- 
level: "medium"
