title: "Powershell Profile Malicious Process Start Added"
id: 
description: "Detects the addition of process execution strings (TgtProcCmdLine In Contains Anycase (list))to the powershell profile, through CommandLine and CommandScript indicators."
references:
- keyboardcrunch
author: Cyber Panda
date: 2023/01/15
tags:
- attack.persistence
- attack.privilege_escalation
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains|all:  
      - ‘Add-Content $profile'
    selection2:
     CommandLine|contains:  
      - ‘Start-Process'
      - ‘&’
      - 'cmd.exe /c’ 
    selection3:
     ScriptBlockText|contains|all:  
      - ‘Add-Content $profile’
    selection4:
     ScriptBlockText|contains:  
      - ‘Start-Process'
      - ‘&’
      - 'cmd.exe /c’ 
  condition: (selection and selection2) or (selection3 and selection4)
fields:
- ""
falsepositives:
- stackify
level: "medium"
