title: "SYSVOL Groups.xml cPassword Search"
id: 
description: "SYSVOL Groups.xml cPassword Search"
references:
- https://fuzzysecurity.com/tutorials/16.html
author: Cyber Panda
date: 2023/04/06
tags:
- attack.privilege_escalation
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - ‘SYSVOL’
    - ‘groups.xml’
  condition: selection
fields:
- ""
falsepositives:
- Didn't come across any
level: "high"
