title: "Unattend and Sysprep Passwords (Cmd Event)"
id: 
description: "Unattend and Sysprep Passwords (Cmd Event)"
references:
- https://fuzzysecurity.com/tutorials/16.html
author: Cyber Panda
date: 2023/04/06
tags:
- attack.privilege_escalation
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ‘sysprep.inf’
    - ‘sysprep.xml’
    - ‘unattended.xml’
  condition: selection
fields:
- ""
falsepositives:
- I would think there are but didn't see any
level: "high"
