title: "Unattend and Sysprep Passwords (File Event)"
id:
status: experimental
description: "Unattend and Sysprep Passwords (File Event)"
references:
    - https://fuzzysecurity.com/tutorials/16.html
author: Cyber Panda
date: 2023/04/06
modified: 2023/04/06
tags:
    - attack.privilege_escalation
logsource:
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
    		- ‘sysprep.inf’
    		- ‘sysprep.xml’
    		- ‘unattended.xml’
    condition: selection
falsepositives:
    - 
level: medium
