title: "LSASS RunDLL MiniDump"
id: 
description: "LSASS RunDLL MiniDump"
references:
- https://redcanary.com/threat-detection-report/techniques/lsass-memory/
author: Cyber Panda
date: 2023/04/03
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.collection
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains:
    - ‘rundll’
   selection2:
    CommandLine|contains:
    - ‘MiniDump’
  condition: selection and selection2
fields:
- ""
falsepositives:
- FireFox MiniDump Analyzer
level: "high"
