title: "Password Searching: Find and Password"
id: 
description: "Password Searching: Find and Password"
references:
- https://github.com/cyb3rpanda/Hitch-Hackers-Guide-to-the-Network/blob/main/Hitch-Hacker's%20Guide%20to%20the%20Network.pdf
author: Cyber Panda
date: 2023/04/03
tags:
- attack.collection
logsource:
  product: windows
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
    - ‘find’
    - ‘Get-ChildItem’
   selection2:
    CommandLine|contains:
    - ‘password’
    - ‘.kdb’
    - ‘.pfx’
    - ‘.cert’
    - ‘.pem’
    - ‘.csv’
    selection3:
    CommandLine|contains:
    - ‘chcp 65001’					#ServiceNow
    -‘--find-renames’				#
    - ‘SupportAssistAgent’		#Dell SupportAssistAgent
    - ‘getIssueList’				#Jira
    - ‘runFromIssueList’			#Jira
    -‘test -e’							#Ubuntu WSL checking files
    -‘zookeeper’					#Zookeeper
  condition: selection and selection2 and not selection3
fields:
- ""
falsepositives:
- See selection3
- File Names Containing Instructions
level: "medium"
