title: CertUtil Abuse Process Accessing DLL or EXE
id:
status: experimental
description: Looks for CertUtil abuse with a certutil process and common parameters use by red teamers
references:
   → https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil 
   → https://www.varonis.com/blog/the-malware-hiding-in-your-windows-system32-folder-part-iii-certutil-and-alternate-data-streams 
   → https://www.trendmicro.com/en_us/research/18/j/malware-targeting-brazil-uses-legitimate-windows-components-wmi-and-certutil-as-part-of-its-routine.html  
   → https://securityintelligence.com/posts/x-force-prevents-zero-day-from-going-anywhere/
author: Cyber Panda
date: 2023/07/27
modified: 2023/07/27
tags:
    - attack.initial_access
    - attack.defense_evasion
    - attack.command_and_control
    - certutil
logsource:
    category: process_creation
detection:
    selection:
        Image|endswith:
            - 'certutil.exe'
     selection2:
        CommandLine|contains|EndsWith:
        	- .dll
        	- .exe
     selection3:
        ScriptBlockText|contains:
        	- .dll
        	- .exe
    condition: selection and (selection2 or selection3)
falsepositives:
    - 
level: medium
