title: "Reverse Shells Socat"
id: 
description: "Reverse Shells Socat"
references:
- https://highon.coffee/blog/reverse-shell-cheat-sheet/
author: Cyber Panda
date: 2023/02/06
tags:
- attack.lateral_movement
- atttack.command_and_control
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
    selection:
     CommandLine|contains:  
      - ‘socat ’
  condition: selection
fields:
- ""
falsepositives:
- Red Hat Openshift
level: "medium"
